soap.xml

<?xml version="1.0"?>
<S:Envelope
        xmlns:S="http://www.w3.org/2003/05/soap-envelope">
    <S:Body>
        <ns2:GetUnsolvedHomeTasks
                xmlns:ns2="http://api1.controller.diana.javarush.com/">
            <sessionId>
                493e0933-0021-4400-ba39-acdce417d397
            </sessionId>
        </ns2:GetUnsolvedHomeTasks>
    </S:Body>
</S:Envelope>
